src/cf/InformationRegisters/ПорядокОтраженияЗарплатыВБухУчете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПорядокОтраженияЗарплатыВБухУчете</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтражениеВУСН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтражениеВУСН</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетНУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоНУ1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоНУ2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоНУ3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СпособОтраженияЗарплатыВБухУчете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕНВД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ОтражениеВУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ОтражениеВУСН</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Принимаются</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринимаются</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Распределяются</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратРасхода</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ПодразделенияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПодразделенияОрганизаций</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонныйКоэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Comment>Подразделение является обособленным</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКодПоОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сформировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксБП20</Name>
					<Comment>Префикс для формирования номера документов (БП 2.0)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦифровойИндексОбособленногоПодразделения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расформировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасформирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСоответствуетСудамЗарегистрированнымВРоссийскомМеждународномРеестреСудов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочиванияИерархического</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименяемыйЛьготныйТерриториальныйТариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыТарифовСтраховыхВзносов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляЗаписейОТрудовойДеятельности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботыСотрудников</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГрафикРаботыСотрудниковПодразделенияОрганизации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмеетНомерТерриториальногоОрганаРосстата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТерриториальногоОрганаРосстата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСевернойНадбавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОрганаФСГС</Name>
					<Comment>Код территориального органа государственной статистики </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКВЭД2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОКВЭД2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонныйКоэффициентРФ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СамостоятельнаяКлассификационнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СамостоятельныеКлассификационныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment> Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/ПорядокОтраженияЗарплатыВБухУчете/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет регистр значениями по умолчанию.
//
// Параметры:
//  СпособОтраженияЗарплатыВБухучете - СправочникСсылка.СпособыОтраженияЗарплатыВБухУчете - способ отражения, устанавливаемый в новых записях
//  ЕНВД - Булево - Истина для создания записей для особого порядка налогообложения
//
Процедура СоздатьПоУмолчанию(СпособОтраженияЗарплатыВБухучете, ЕНВД) Экспорт
	
	Если ЕНВД Тогда
		ИмяСтатьи = "ОплатаТрудаЕНВД";
	Иначе
		ИмяСтатьи = "ОплатаТруда";
	КонецЕсли;
	
	СтатьяЗатрат = Справочники.СтатьиЗатрат.СтатьяЗатратПоНазначению(ИмяСтатьи);
	// При отсутствии статьи, запись будет создана с пустой статьей.
	// Статья будет заполнена в записи по мере создания статьи - см. УстановитьСтатьюЗатрат
	
	АналитикаЗатрат = Новый Соответствие;
	АналитикаЗатрат.Вставить(
		Тип("ПланСчетовСсылка.Хозрасчетный"),
		ПланыСчетов.Хозрасчетный.ОбщехозяйственныеРасходы);
		
	Если ЗначениеЗаполнено(СтатьяЗатрат) Тогда
		АналитикаЗатрат.Вставить(
			ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат,
			СтатьяЗатрат);
	КонецЕсли;
	
	Запись = СоздатьМенеджерЗаписи();
	
	ЗаполнитьЗначенияСвойств(Запись, УчетЗатрат.АналитикаЗатратНомераСубконто(АналитикаЗатрат));
	
	Запись.СпособОтраженияЗарплатыВБухУчете = СпособОтраженияЗарплатыВБухучете;
	Запись.ЕНВД                             = ЕНВД;
	Если ЕНВД Тогда
		Запись.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются;
	Иначе
		Запись.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
	КонецЕсли;
	
	Запись.Записать();
	
КонецПроцедуры

// Заполняет регистр на основании переданных значений аналитики учета.
//
// Параметры:
//  СпособОтраженияЗарплатыВБухучете - СправочникСсылка.СпособыОтраженияЗарплатыВБухУчете - способ отражения, устанавливаемый
//                                                                                          в новых записях.
//  СчетУчета - ПланСчетовСсылка.Хозрасчетный - счет учета, устанавливаемый в новых записях.
//  СтатьяРасходов - СправочникСсылка.СтатьиЗатрат, Справочники.ПрочиеДоходыИРасходы - статья затрат для заполнения в новых записях.
//                                                                                     Если не передана, будет заполнена по умолчанию.
//  ОсобыйПорядок - Булево - Истина для создания записей для особого порядка налогообложения.
//  ОтражениеВУСН - ПеречислениеСсылка.ОтражениеВУСН - отражение расходов в УСН и АУСН, заданное для новых записей.
//
Процедура СоздатьПоАналитике(СпособОтраженияЗарплатыВБухучете, СчетУчета, Знач СтатьяРасходов = Неопределено, ОсобыйПорядок, ОтражениеВУСН) Экспорт
	
	Если СтатьяРасходов = Неопределено Тогда
		ИмяСтатьи = СтрШаблон("ОплатаТруда%1", ?(ОсобыйПорядок, "ЕНВД", ""));
		СтатьяРасходов = Справочники.СтатьиЗатрат.СтатьяЗатратПоНазначению(ИмяСтатьи);
	КонецЕсли;
	
	// При отсутствии статьи, запись будет создана с пустой статьей.
	// Статья будет заполнена в записи по мере создания статьи - см. УстановитьСтатьюЗатрат
	
	АналитикаЗатрат = Новый Соответствие;
	АналитикаЗатрат.Вставить(Тип("ПланСчетовСсылка.Хозрасчетный"), СчетУчета);
	
	Если ЗначениеЗаполнено(СтатьяРасходов) Тогда
		Если ТипЗнч(СтатьяРасходов) = Тип("СправочникСсылка.ПрочиеДоходыИРасходы") Тогда
			ВидСубконтоРасходов = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы;
		Иначе
			ВидСубконтоРасходов = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат;
		КонецЕсли;
		АналитикаЗатрат.Вставить(
			ВидСубконтоРасходов,
			СтатьяРасходов);
	КонецЕсли;
	
	Запись = СоздатьМенеджерЗаписи();
	
	ЗаполнитьЗначенияСвойств(Запись, УчетЗатрат.АналитикаЗатратНомераСубконто(АналитикаЗатрат));
	
	Запись.СпособОтраженияЗарплатыВБухУчете = СпособОтраженияЗарплатыВБухучете;
	Запись.ЕНВД = ОсобыйПорядок;
	
	Если ОсобыйПорядок Тогда
		Запись.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются;
	Иначе
		Запись.ОтражениеВУСН = ОтражениеВУСН;
	КонецЕсли;
	
	Запись.Записать();
	
КонецПроцедуры

// В имеющихся записях регистра заполняет значение статьи затрат.
//
// Параметры:
//  СтатьяЗатрат - СправочникСсылка.СтатьиЗатрат - устанавливаемая статья
//  ЕНВД - Булево - Истина для обработки записей для особого порядка налогообложения
//
Процедура УстановитьСтатьюЗатрат(СтатьяЗатрат, ЕНВД) Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПорядокОтраженияЗарплатыВБухУчете");
	ЭлементБлокировки.УстановитьЗначение("ЕНВД", ЕНВД);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЕНВД.Установить(ЕНВД);
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	Попытка
	
		Блокировка.Заблокировать();
		
		НаборЗаписей.Прочитать();
		
		Для Каждого Запись Из НаборЗаписей Цикл
			
			УстановитьСтатьюЗатратЗаписи(Запись, СтатьяЗатрат, "");
			УстановитьСтатьюЗатратЗаписи(Запись, СтатьяЗатрат, "НУ");
			
		КонецЦикла;
		
		Если НаборЗаписей.Модифицированность() Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

// Определяет статью затрат, используемую по-умолчанию для отражения зарплаты в учете.
//
// Параметры:
//  ЕНВД - Булево - Истина для получения статьи, предназначенной для особого порядка налогообложения
// 
// Возвращаемое значение:
//  СправочникСсылка.СтатьиЗатрат - статья, указанная в регистре
//
Функция ОсновнаяСтатьяЗатрат(ЕНВД) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЕНВД", ЕНВД);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ХозрасчетныйВидыСубконто.НомерСтроки = 1
	|			ТОГДА Настройки.Субконто1
	|		КОГДА ХозрасчетныйВидыСубконто.НомерСтроки = 2
	|			ТОГДА Настройки.Субконто2
	|		КОГДА ХозрасчетныйВидыСубконто.НомерСтроки = 3
	|			ТОГДА Настройки.Субконто3
	|	КОНЕЦ КАК СтатьяЗатрат,
	|	Настройки.СпособОтраженияЗарплатыВБухУчете КАК СпособОтражения
	|ПОМЕСТИТЬ Настройки
	|ИЗ
	|	РегистрСведений.ПорядокОтраженияЗарплатыВБухУчете КАК Настройки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ХозрасчетныйВидыСубконто
	|		ПО Настройки.Счет = ХозрасчетныйВидыСубконто.Ссылка
	|			И (ХозрасчетныйВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат))
	|ГДЕ
	|	Настройки.ЕНВД = &ЕНВД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Настройки.СтатьяЗатрат КАК СтатьяЗатрат,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Настройки.СпособОтражения) КАК Частотность
	|ИЗ
	|	Настройки КАК Настройки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтатьиЗатрат КАК СтатьиЗатрат
	|		ПО Настройки.СтатьяЗатрат = СтатьиЗатрат.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Настройки.СтатьяЗатрат
	|
	|УПОРЯДОЧИТЬ ПО
	|	Частотность УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СтатьяЗатрат;
	Иначе
		Возврат Справочники.СтатьиЗатрат.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

#КонецОбласти
#Область СлужебныеПроцедурыИФункции

Процедура УстановитьСтатьюЗатратЗаписи(Запись, СтатьяЗатрат, СуффиксПолей)

	СчетИСубконто = Новый Структура;
	
	Счет = Запись["Счет" + СуффиксПолей];
	Если Не ЗначениеЗаполнено(Счет) И ЗначениеЗаполнено(СуффиксПолей) Тогда
		// В регистре принят такой прием: если счет НУ не заполнен, то подразумевается счет без НУ
		Счет = Запись.Счет;
	КонецЕсли;
	
	СчетИСубконто.Вставить("Счет", Счет);
	Для НомерСубконто = 1 По 3 Цикл
		ИдентификаторСубконто = XMLСтрока(НомерСубконто);
		СчетИСубконто.Вставить(
			"Субконто" + ИдентификаторСубконто,
			Запись["Субконто" + СуффиксПолей + ИдентификаторСубконто]);
	КонецЦикла;
	СчетИСубконто.Вставить("Подразделение", Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	
	АналитикаЗатрат = УчетЗатрат.АналитикаЗатратПоСчетуИСубконто(СчетИСубконто);
	
	ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат;
	
	Если ЗначениеЗаполнено(АналитикаЗатрат[ВидСубконто]) Тогда
		Возврат;
	КонецЕсли;
	
	АналитикаЗатрат.Вставить(ВидСубконто, СтатьяЗатрат);
	
	НовыеЗначенияСубконто = УчетЗатрат.АналитикаЗатратНомераСубконто(АналитикаЗатрат);
	
	Для НомерСубконто = 1 По 3 Цикл
		
		ИдентификаторСубконто = XMLСтрока(НомерСубконто);
		
		ИмяСубконто = "Субконто" + ИдентификаторСубконто;
		
		Если Не НовыеЗначенияСубконто.Свойство(ИмяСубконто) Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеСубконто = НовыеЗначенияСубконто[ИмяСубконто];
		
		ИмяПоляЗаписи = "Субконто" + СуффиксПолей + ИдентификаторСубконто;
		
		Если Запись[ИмяПоляЗаписи] = ЗначениеСубконто Тогда
			// Для предотвращения ненужной модификации и записи набора
			Продолжить;
		КонецЕсли;
		
		Запись[ИмяПоляЗаписи] = ЗначениеСубконто;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
